Import python libraries.

In [1]:
import pandas as pd
import numpy as np

Read and preview the data.

In [2]:
data = pd.read_csv('kiva_loans.csv')
data.head()

,id,funded_amount,loan_amount,activity,sector,use,country_code,country,region,currency,partner_id,posted_time,disbursed_time,funded_time,term_in_months,lender_count,tags,borrower_genders,repayment_interval,date
0,653051,300.0,300.0,Fruits & Vegetables,Food,"To buy seasonal, fresh fruits to sell.",PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:12:39+00:00,2013-12-17 08:00:00+00:00,2014-01-02 10:06:32+00:00,12.0,12,NaN,female,irregular,2014-01-01
1,653053,575.0,575.0,Rickshaw,Transportation,to repair and maintain the auto rickshaw used ...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:51:08+00:00,2013-12-17 08:00:00+00:00,2014-01-02 09:17:23+00:00,11.0,14,NaN,"female, female",irregular,2014-01-01
2,653068,150.0,150.0,Transportation,Transportation,To repair their old cycle-van and buy another ...,IN,India,Maynaguri,INR,334.0,2014-01-01 09:58:07+00:00,2013-12-17 08:00:00+00:00,2014-01-01 16:01:36+00:00,43.0,6,"user_favorite, user_favorite",female,bullet,2014-01-01
3,653063,200.0,200.0,Embroidery,Arts,to purchase an embroidery machine and a variet...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 08:03:11+00:00,2013-12-24 08:00:00+00:00,2014-01-01 13:00:00+00:00,11.0,8,NaN,female,irregular,2014-01-01
4,653084,400.0,400.0,Milk Sales,Food,to purchase one buffalo.,PK,Pakistan,Abdul Hakeem,PKR,245.0,2014-01-01 11:53:19+00:00,2013-12-17 08:00:00+00:00,2014-01-01 19:18:51+00:00,14.0,16,NaN,female,monthly,2014-01-01

Look at data columns, null values and data types.

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 20 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   funded_amount       671205 non-null  float64
 2   loan_amount         671205 non-null  float64
 3   activity            671205 non-null  object
 4   sector              671205 non-null  object
 5   use                 666973 non-null  object
 6   country_code        671197 non-null  object
 7   country             671205 non-null  object
 8   region              614405 non-null  object
 9   currency            671205 non-null  object
 10  partner_id          657698 non-null  float64
 11  posted_time         671205 non-null  object
 12  disbursed_time      668809 non-null  object
 13  funded_time         622874 non-null  object
 14  term_in_months      671205 non-null  float64
 15  lender_count        671205 non-null  int64
 16  tags                499789 non-null  object
 17  borrower_genders    666984 non-null  object
 18  repayment_interval  671205 non-null  object
 19  date                671205 non-null  object
dtypes: float64(4), int64(2), object(14)
memory usage: 102.4+ MB

I will drop the following columns because they do not any information that will help in the analysis of Kiva borrowers.

In [4]:
#drop the following columns because they do not have a direct relationship with the borrowers of Kiva.
data.drop(['funded_amount', 'activity', 'use', 'country_code', 'region', 'currency', 'partner_id', 'posted_time', 'disbursed_time', 'funded_time', 'lender_count', 'tags'], axis=1, inplace=True)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   loan_amount         671205 non-null  float64
 2   sector              671205 non-null  object
 3   country             671205 non-null  object
 4   term_in_months      671205 non-null  float64
 5   borrower_genders    666984 non-null  object
 6   repayment_interval  671205 non-null  object
 7   date                671205 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 41.0+ MB

In [6]:
data.sample(10)

,id,loan_amount,sector,country,term_in_months,borrower_genders,repayment_interval,date
523561,1183424,1200.0,Agriculture,Cambodia,19.0,female,monthly,2016-11-11
247004,894357,400.0,Food,Colombia,15.0,female,bullet,2015-05-29
235056,882940,1000.0,Clothing,Georgia,14.0,female,monthly,2015-05-11
436448,1095803,2200.0,Housing,Vietnam,14.0,"female, female, female, female, female, female...",irregular,2016-06-07
567836,1228678,925.0,Agriculture,Myanmar (Burma),9.0,"male, male, male, male, male",bullet,2017-01-29
413787,1060225,925.0,Food,Peru,6.0,female,irregular,2016-04-25
20801,673805,400.0,Retail,Haiti,2.0,male,bullet,2014-02-20
631984,1294072,350.0,Food,Philippines,11.0,female,irregular,2017-05-08
206314,854108,575.0,Food,Philippines,11.0,female,irregular,2015-03-12
64682,716758,225.0,Food,Colombia,15.0,female,monthly,2014-05-27

I'll change the date column to a datetime data type for easy time analysis.

In [7]:
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')

I'll use isnull() method and chain it with sum() to find the total number of nulls in each column in the DataFrame

In [8]:
data.isnull().sum()

id                       0
loan_amount              0
sector                   0
country                  0
term_in_months           0
borrower_genders      4221
repayment_interval       0
date                     0
dtype: int64

In [9]:
data.shape

(671205, 8)

I'll drop the rows with missing values, since 4221 is not such a significant number to do away with in my DataFrame.

In [10]:
#drop any row with a missing value
data.dropna(axis=0, how='any', inplace=True)

In [11]:
data.shape

(666984, 8)

I have noticed some anomalies in the gender column that could have occurred during data collection, so I'll clean it up.

In [12]:
data['borrower_genders'].sample(10)

3548        male
402934      male
530843    female
443506    female
376028    female
344767    female
29255     female
437195    female
93495     female
150573    female
Name: borrower_genders, dtype: object

I'll create a new column, of boolean type, to contain strings that contains female. True contains female, and False will hence contain male.

In [13]:
data['female_gender'] = data['borrower_genders'].str.contains('female')

I'll create a gender column that encodes the above classification into 'F' and 'M'.

In [14]:
data.loc[data['female_gender'] == True, 'gender'] = 'F'
data.loc[data['female_gender'] == False, 'gender'] ='M'

I will drop the following columns since I now have a clean gender column. Using the drop() method, with axis and inplace arguments.

In [15]:
data.drop(['borrower_genders', 'female_gender'], axis=1, inplace=True)

Now let's look at unique values and their counts in the gender column, using value_counts() method.

In [16]:
print(data['gender'].value_counts())

F    528461
M    138523
Name: gender, dtype: int64

I will convert the gender column into a category.

In [17]:
category = ['F', 'M']
cat_dtype = pd.api.types.CategoricalDtype(categories=category, ordered=True)
data['gender'] = data['gender'].astype(cat_dtype)

print(data.gender.sample(5))

95205     M
504652    M
613836    F
81214     F
77        M
Name: gender, dtype: category
Categories (2, object): [F < M]

Let's look at the repayment_interval column.
Use value_counts() to find counts of unique values in the column.

In [18]:
print(data['repayment_interval'].value_counts())

monthly      340171
irregular    256573
bullet        69638
weekly          602
Name: repayment_interval, dtype: int64

bullet could mean daily, so I'll change it.

In [19]:
data.loc[data['repayment_interval'] == 'bullet', 'repayment_interval'] = 'daily'

I'll change the repayment_interval column to a category too. Directly, using astype() method, with category as an argument.

In [20]:
data['repayment_interval'] = data['repayment_interval'].astype('category')
print(data['repayment_interval'].dtype)
print(data.repayment_interval.value_counts())

category
monthly      340171
irregular    256573
daily         69638
weekly          602
Name: repayment_interval, dtype: int64

Let's look at the country column

In [21]:
data.country.head()

0    Pakistan
1    Pakistan
2       India
3    Pakistan
4    Pakistan
Name: country, dtype: object

In [22]:
print(data.country.unique())
print(data.country.nunique())

['Pakistan' 'India' 'Kenya' 'Nicaragua' 'El Salvador' 'Tanzania'
 'Philippines' 'Peru' 'Senegal' 'Cambodia' 'Liberia' 'Vietnam' 'Iraq'
 'Honduras' 'Palestine' 'Mongolia' 'United States' 'Mali' 'Colombia'
 'Tajikistan' 'Guatemala' 'Ecuador' 'Bolivia' 'Yemen' 'Ghana'
 'Sierra Leone' 'Haiti' 'Chile' 'Jordan' 'Uganda' 'Burundi' 'Burkina Faso'
 'Timor-Leste' 'Indonesia' 'Georgia' 'Ukraine' 'Kosovo' 'Albania'
 'The Democratic Republic of the Congo' 'Costa Rica' 'Somalia' 'Zimbabwe'
 'Cameroon' 'Turkey' 'Azerbaijan' 'Dominican Republic' 'Brazil' 'Mexico'
 'Kyrgyzstan' 'Armenia' 'Paraguay' 'Lebanon' 'Samoa' 'Israel' 'Rwanda'
 'Zambia' 'Nepal' 'Congo' 'Mozambique' 'South Africa' 'Togo' 'Benin'
 'Belize' 'Suriname' 'Thailand' 'Nigeria' 'Mauritania' 'Vanuatu' 'Panama'
 'Virgin Islands' 'Saint Vincent and the Grenadines'
 "Lao People's Democratic Republic" 'Myanmar (Burma)' 'Malawi' 'Moldova'
 'South Sudan' 'Solomon Islands' 'China' 'Egypt' 'Guam' 'Afghanistan'
 'Madagascar' 'Namibia' 'Puerto Rico' 'Lesotho' "Cote D'Ivoire" 'Bhutan']
87

Let's also look at the sector column

In [23]:
print(data.sector.unique())
print(data.sector.nunique())
data.sector.value_counts()

['Food' 'Transportation' 'Arts' 'Services' 'Agriculture' 'Manufacturing'
 'Wholesale' 'Retail' 'Clothing' 'Construction' 'Health' 'Education'
 'Personal Use' 'Housing' 'Entertainment']
15

Agriculture       179224
Food              135749
Retail            123758
Services           44699
Personal Use       36247
Housing            33571
Clothing           32480
Education          30837
Transportation     15455
Arts               11994
Health              9172
Construction        6194
Manufacturing       6158
Entertainment        820
Wholesale            626
Name: sector, dtype: int64

Because Food and Agriculture are directly related, I have changed them to one: Agriculture

In [24]:
data.loc[data['sector'] == 'Food', 'sector'] = 'Agriculture'
data.sector.unique()

array(['Agriculture', 'Transportation', 'Arts', 'Services',
       'Manufacturing', 'Wholesale', 'Retail', 'Clothing', 'Construction',
       'Health', 'Education', 'Personal Use', 'Housing', 'Entertainment'],
      dtype=object)

Check for duplicates in the whole DataFrame using the duplicated() method.

In [25]:
data.duplicated().sum()

0

### Testing hypothesis towards finding out about the borrowers in Kiva.


1.Who are they?-Gender.
2.What do they do?-Sector
3.Where do they come from?-Country
4.How long have they borrowed?-term in months
5.How do they pay? Poverty levels? -repayment intervals
6.Which country borrows the most or the least? & In which sector?

#### 1.What is the gender of most borrowers in Kiva?

###### My hypothesis is that most borrowers in Kiva are female.

I will create variables with counts of each gender and use the total to calculate the percentage of each gender.

In [26]:
female_borrowers = data.gender[data['gender'] == 'F'].count()
male_borrowers = data.gender[data['gender'] == 'M'].count()
total_borrowers = data.shape[0]
print('The female borrowers are: {:.0%}'.format(female_borrowers /total_borrowers))
print('The male borrowers are: {:.0%}'.format(male_borrowers /total_borrowers))

The female borrowers are: 79%
The male borrowers are: 21%

##### Female borrowers, at 79% are more than male borrowers at 21%.

#### 2.In which sector are the female and male genders involved in respectively?

###### My hypothesis is that most female are in the Agriculture sector, and male in the Transportation sector.

In [27]:
female_data = data[data['gender'] == 'F']
male_data = data[data['gender'] == 'M']
female_data.head(5)
#male_data.sample(10)

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
0,653051,300.0,Agriculture,Pakistan,12.0,irregular,2014-01-01,F
1,653053,575.0,Transportation,Pakistan,11.0,irregular,2014-01-01,F
2,653068,150.0,Transportation,India,43.0,daily,2014-01-01,F
3,653063,200.0,Arts,Pakistan,11.0,irregular,2014-01-01,F
4,653084,400.0,Agriculture,Pakistan,14.0,monthly,2014-01-01,F

In [28]:
female_data['sector'].value_counts()

Agriculture       250078
Retail            109244
Services           34512
Clothing           29752
Personal Use       27580
Housing            25177
Education          19008
Arts               10758
Transportation      8521
Health              6203
Manufacturing       3799
Construction        3047
Entertainment        424
Wholesale            358
Name: sector, dtype: int64

Most female borrowers are in the Agriculture sector.

In [29]:
print('The sector with the most amount of loan borrowed:', data.groupby('sector')['loan_amount'].sum().idxmax())
print('The highest loan amount borrowed per sector:{:.0f}'.format(data.groupby('sector')['loan_amount'].sum().max()))

The sector with the most amount of loan borrowed: Agriculture
The highest loan amount borrowed per sector:262627050

In [30]:
male_data['sector'].value_counts()

Agriculture       64895
Retail            14514
Education         11829
Services          10187
Personal Use       8667
Housing            8394
Transportation     6934
Construction       3147
Health             2969
Clothing           2728
Manufacturing      2359
Arts               1236
Entertainment       396
Wholesale           268
Name: sector, dtype: int64

Most male borrowers are also in the Agriculture sector.

##### Both male and female borrowers are in the agricultural sector.

#### 3. In which country do most borrowers come from?

In [53]:
country_grouped = data.groupby('country').agg({'gender': ['value_counts']})
country_grouped.head(5)

                         gender
                   value_counts
country     gender
Afghanistan F                 2
Albania     F              1018
            M               899
Armenia     F              5383
            M              3245

In [60]:
type(country_grouped)

pandas.core.frame.DataFrame

In [52]:
print(country_grouped['gender'].idxmin(), country_grouped['gender'].min())

value_counts    (Bhutan, F)
dtype: object value_counts    1
dtype: int64

In [34]:
print(country_grouped['gender'].idxmax(), country_grouped['gender'].max())

value_counts    (Philippines, F)
dtype: object value_counts    151984
dtype: int64

##### The highest country borrrower is Phillipines. In Phillippines, the female gender borrows the most.
##### The lowest country borrower is Bhutan. With one female borrower.

Why Phillipines? Is Kiva a Phillipines' company? Have more financial campaigns been done in Phillipines?

#### 4. How long have they borrowed?
Which is the longest borrowing gender?
Which is the longest borrowing country?

In [66]:
data.term_in_months.sample(5)
data.term_in_months.describe()

count    666984.000000
mean         13.730235
std           8.596158
min           1.000000
25%           8.000000
50%          13.000000
75%          14.000000
max         158.000000
Name: term_in_months, dtype: float64

In [82]:
term_gender = data.groupby('gender')['term_in_months'].max()
term_gender

gender
F    158.0
M    154.0
Name: term_in_months, dtype: float64

In [84]:
term_country = data.groupby('country')['term_in_months'].max()
term_country.sort_values(ascending=False)

country
Dominican Republic    158.0
Mexico                144.0
South Africa          141.0
Kenya                 122.0
Cambodia              120.0
                      ...
Lesotho                12.0
Cote D'Ivoire          10.0
Congo                   8.0
Afghanistan             8.0
Namibia                 7.0
Name: term_in_months, Length: 87, dtype: float64

In [70]:
data.loc[data['term_in_months'] == 158]

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
215863,863993,6725.0,Education,Dominican Republic,158.0,irregular,2015-03-30,F

term_sorted = data[['loan_amount', 'sector', 'country', 'term_in_months', 'gender']]
term_sorted.drop_duplicates(subset='term_in_months', keep=False)
#term_sorted.sort_values(by='term_in_months', axis=1, ascending=False, inplace=True)
term_sorted.head(10)

In [67]:
data.tail()

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
671199,1340318,25.0,Agriculture,Paraguay,13.0,monthly,2017-07-25,F
671200,1340323,25.0,Agriculture,Paraguay,13.0,monthly,2017-07-25,F
671201,1340316,25.0,Agriculture,Kenya,13.0,monthly,2017-07-25,F
671203,1340338,25.0,Agriculture,Kenya,13.0,monthly,2017-07-26,F
671204,1340339,25.0,Agriculture,Kenya,13.0,monthly,2017-07-26,F

In [72]:
data.loc[data['term_in_months']== 1]

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
1877,1080189,125.0,Services,Kenya,1.0,irregular,2014-01-08,M
2915,1080219,250.0,Clothing,Kenya,1.0,irregular,2014-01-10,F
4277,1080268,125.0,Agriculture,Kenya,1.0,irregular,2014-01-15,M
6772,1080311,125.0,Clothing,Kenya,1.0,irregular,2014-01-21,F
7851,1080328,125.0,Services,Kenya,1.0,weekly,2014-01-23,M
10478,1080374,125.0,Clothing,Kenya,1.0,irregular,2014-01-29,F
11319,1080391,250.0,Transportation,Kenya,1.0,irregular,2014-01-31,F
11410,1080393,250.0,Retail,Kenya,1.0,irregular,2014-01-31,F
11488,1080392,250.0,Agriculture,Kenya,1.0,irregular,2014-01-31,F
11599,1080394,250.0,Agriculture,Kenya,1.0,irregular,2014-01-31,F
11617,1080388,250.0,Services,Kenya,1.0,irregular,2014-01-31,M
11800,1080405,250.0,Services,Kenya,1.0,irregular,2014-02-02,F
11803,1080404,250.0,Retail,Kenya,1.0,irregular,2014-02-02,F
12178,1080420,250.0,Retail,Kenya,1.0,irregular,2014-02-03,F
12453,1080434,250.0,Clothing,Kenya,1.0,irregular,2014-02-04,F
14310,1080473,125.0,Retail,Kenya,1.0,irregular,2014-02-09,F
15542,1080489,125.0,Clothing,Kenya,1.0,irregular,2014-02-11,F
29016,1080675,250.0,Retail,Kenya,1.0,irregular,2014-03-11,F
29789,1080683,250.0,Clothing,Kenya,1.0,irregular,2014-03-12,F
39694,1080894,250.0,Construction,Kenya,1.0,irregular,2014-04-02,F
45830,1081076,125.0,Clothing,Kenya,1.0,irregular,2014-04-16,F
45986,1081078,125.0,Retail,Kenya,1.0,irregular,2014-04-16,F
48474,1081137,250.0,Agriculture,Kenya,1.0,irregular,2014-04-23,M
49396,1081156,250.0,Clothing,Kenya,1.0,irregular,2014-04-24,F
53098,1081263,125.0,Agriculture,Kenya,1.0,weekly,2014-05-03,F
81739,1082038,250.0,Transportation,Kenya,1.0,irregular,2014-07-02,F
82547,1082049,250.0,Agriculture,Kenya,1.0,irregular,2014-07-03,F
121850,1083671,100.0,Agriculture,Kenya,1.0,irregular,2014-09-22,F
196159,1087579,75.0,Agriculture,Kenya,1.0,irregular,2015-02-20,F
199098,1087727,75.0,Agriculture,Kenya,1.0,irregular,2015-02-26,F
208871,1088074,75.0,Agriculture,Kenya,1.0,irregular,2015-03-17,F

In [41]:
#Why is the .max() method giving a different value from the max in the .describe() method?
#I can't deduce this hypothesis.
#Later

6. At what intervals do they pay?

In [42]:
data['repayment_interval'].value_counts()

monthly      340171
irregular    256573
daily         69638
weekly          602
Name: repayment_interval, dtype: int64

In [43]:
print(data['repayment_interval'].value_counts().idxmax(), data['repayment_interval'].value_counts().max())

monthly 340171

Monthly repayments are the highest, closely followed by irregular payments.

In [44]:
data.groupby('sector')['repayment_interval'].value_counts()

sector          repayment_interval
Agriculture     monthly               143730
                irregular             123152
                daily                  47955
                weekly                   136
Arts            monthly                 5898
                irregular               4627
                daily                   1454
                weekly                    15
Clothing        monthly                17845
                irregular              13521
                daily                    976
                weekly                   138
Construction    monthly                 4358
                irregular               1545
                daily                    280
                weekly                    11
Education       monthly                24076
                irregular               4331
                daily                   2430
Entertainment   monthly                  439
                irregular                226
                daily                    155
Health          monthly                 7374
                irregular               1654
                daily                    131
                weekly                    13
Housing         monthly                24259
                irregular               8442
                daily                    870
Manufacturing   monthly                 3284
                irregular               2433
                daily                    441
Personal Use    monthly                27409
                daily                   4790
                irregular               4048
Retail          irregular              73519
                monthly                45351
                daily                   4764
                weekly                   124
Services        monthly                27088
                irregular              12518
                daily                   4940
                weekly                   153
Transportation  monthly                 8651
                irregular               6394
                daily                    398
                weekly                    12
Wholesale       monthly                  409
                irregular                163
                daily                     54
Name: repayment_interval, dtype: int64

Most loan repayments(both monthly and irregular) come from Agriculture, then Retail and Services.
This means that most economies are run by these three sectors.

In [45]:
data.groupby('country')['repayment_interval'].value_counts().idxmax()

('Philippines', 'irregular')

In [46]:
data['loan_amount'].describe()

count    666984.000000
mean        840.300742
std        1187.909500
min          25.000000
25%         275.000000
50%         500.000000
75%        1000.000000
max      100000.000000
Name: loan_amount, dtype: float64

In [47]:
data.groupby('repayment_interval')['loan_amount'].sum()

repayment_interval
daily         62460325.0
irregular    176700350.0
monthly      321165200.0
weekly          141275.0
Name: loan_amount, dtype: float64

The highest total loan amount has been repaid in monthly intervals, with the lowest being repaid weekly.
This means that Kiva borrowers have to wait for a month so as to repay a loan. Clearly the agriculture sector gives returns on a monthly basis.

In [48]:
#which year,month were most loans taken?
#filter by year or month. How?

A temporary conclusion(some questions still unanswered):
Most Kiva borrowers are female.
Most borrowers(male and female) come from the Phillipines.
Phillipines is also the country with the highest total loan amount borrowed.
Phillipines is also the country that repaid the most loans, irregularly.
I think it's safe to say that Phillipines is an outlier.
The agriculture sector contibutes highly to most loans borrowed and repaid.
Most loan repaymnet intervals are monthly, followed closely by irregularly.
Therefore, poverty levels of Kiva borrowers are low since most people borrow loans to sustain the most basic and largest economic activity- Agriculture.